# PrevDObj

## Description
Function PrevDObj returns the previous deselected object in a list of objects . If the end of the object list is reached, the function returns NIL.

```pascal
FUNCTION PrevDObj(h : HANDLE): HANDLE;
```

```python
def vs.PrevDObj(h):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## See Also
Relative calls:
* NextObj | PrevObj
* FObject | LObject
* FSActLayer | LSActLayer
* FSObject  | LActLayer
* NextDObj | PrevDObj
* NextSObj | PrevSObj

## Version
Availability: from All Versions

## Category
* Document List Handling